tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Console Matrix
brew "cmatrix"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Website copier/offline browser
brew "httrack"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Software environment for statistical computing
brew "r"
# Ruby version manager
brew "rbenv"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# User interface to the TELNET protocol
brew "telnet"
# General-purpose lossless data-compression library
brew "zlib"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Virtual Audio Driver
cask "blackhole-16ch"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "gfxcardstatus"
# Desktop client for GitHub repositories
cask "github"
# Client for the Google Drive storage service
cask "google-drive"
# Power usage monitoring tool enabled for Intel Core processors
cask "intel-power-gadget"
# Game client for itch.io
cask "itch"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Simple and elegant markdown editor
cask "mark-text"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Development environment, tooling platform and application framework
cask "netbeans"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Cloud storage client
cask "onedrive"
# Retro video game emulation
cask "openemu"
# Home media player
cask "plex"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Emulator frontend (Metal graphics API version)
cask "retroarch-metal"
# Data science software focusing on R and Python
cask "rstudio"
# Team communication and collaboration software
cask "slack"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Move and resize windows with ease
cask "spectacle"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# Virtualizer for x86 hardware
cask "virtualbox"
# Extend the functionality of VirtualBox
cask "virtualbox-extension-pack"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "webex"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
