tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Website copier/offline browser
brew "httrack"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# General-purpose lossless data-compression library
brew "zlib"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Text editor
cask "atom"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "gfxcardstatus"
# Desktop client for GitHub repositories
cask "github"
# Client for the Google Drive storage service
cask "google-drive"
# Power usage monitoring tool enabled for Intel Core processors
cask "intel-power-gadget"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Word processor
cask "microsoft-word"
# Development environment, tooling platform and application framework
cask "netbeans"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Cloud storage client
cask "onedrive"
# Retro video game emulation
cask "openemu"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Team communication and collaboration software
cask "slack"
# Move and resize windows with ease
cask "spectacle"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "webex"
# Video communication and virtual meeting platform
cask "zoom"
